# 10 Minutes to pandas

In [1]:
import numpy as np
import pandas as pd

## Object Creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.628005  0.586911 -0.092060 -0.668746
2013-01-02 -0.741923 -0.524688  0.127316  1.594454
2013-01-03 -1.340843  0.579010  0.312559 -0.646849
2013-01-04 -0.254842  0.828681 -0.886268  0.691116
2013-01-05 -0.772479  0.304728  0.350528  1.052831
2013-01-06  0.608737 -0.239192  0.370635 -1.092395

In [6]:
df2 = pd.DataFrame({
    'A': 1,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3]*4,dtype='int32'),
    'E': pd.Categorical(['test', 'train', 'test', 'train']),
    'F': 'foo'
})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -0.628005  0.586911 -0.092060 -0.668746
2013-01-02 -0.741923 -0.524688  0.127316  1.594454
2013-01-03 -1.340843  0.579010  0.312559 -0.646849
2013-01-04 -0.254842  0.828681 -0.886268  0.691116
2013-01-05 -0.772479  0.304728  0.350528  1.052831

In [9]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.772479  0.304728  0.350528  1.052831
2013-01-06  0.608737 -0.239192  0.370635 -1.092395

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.to_numpy()

array([[-0.62800517,  0.58691134, -0.09206012, -0.66874577],
       [-0.74192312, -0.52468823,  0.12731553,  1.59445447],
       [-1.34084259,  0.57901015,  0.31255873, -0.64684921],
       [-0.2548423 ,  0.82868141, -0.88626822,  0.69111581],
       [-0.77247875,  0.304728  ,  0.35052795,  1.05283071],
       [ 0.60873738, -0.2391922 ,  0.37063523, -1.09239542]])

In [13]:
df2.to_numpy()

array([[1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.521559  0.255908  0.030452  0.155068
std    0.654643  0.528936  0.482188  1.099369
min   -1.340843 -0.524688 -0.886268 -1.092395
25%   -0.764840 -0.103212 -0.037216 -0.663272
50%   -0.684964  0.441869  0.219937  0.022133
75%   -0.348133  0.584936  0.341036  0.962402
max    0.608737  0.828681  0.370635  1.594454

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.628005   -0.741923   -1.340843   -0.254842   -0.772479    0.608737
B    0.586911   -0.524688    0.579010    0.828681    0.304728   -0.239192
C   -0.092060    0.127316    0.312559   -0.886268    0.350528    0.370635
D   -0.668746    1.594454   -0.646849    0.691116    1.052831   -1.092395

In [19]:
df

                   A         B         C         D
2013-01-01 -0.628005  0.586911 -0.092060 -0.668746
2013-01-02 -0.741923 -0.524688  0.127316  1.594454
2013-01-03 -1.340843  0.579010  0.312559 -0.646849
2013-01-04 -0.254842  0.828681 -0.886268  0.691116
2013-01-05 -0.772479  0.304728  0.350528  1.052831
2013-01-06  0.608737 -0.239192  0.370635 -1.092395

In [21]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.668746 -0.092060  0.586911 -0.628005
2013-01-02  1.594454  0.127316 -0.524688 -0.741923
2013-01-03 -0.646849  0.312559  0.579010 -1.340843
2013-01-04  0.691116 -0.886268  0.828681 -0.254842
2013-01-05  1.052831  0.350528  0.304728 -0.772479
2013-01-06 -1.092395  0.370635 -0.239192  0.608737

In [22]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.741923 -0.524688  0.127316  1.594454
2013-01-06  0.608737 -0.239192  0.370635 -1.092395
2013-01-05 -0.772479  0.304728  0.350528  1.052831
2013-01-03 -1.340843  0.579010  0.312559 -0.646849
2013-01-01 -0.628005  0.586911 -0.092060 -0.668746
2013-01-04 -0.254842  0.828681 -0.886268  0.691116

## Selection

### Getting

In [23]:
df['A']

2013-01-01   -0.628005
2013-01-02   -0.741923
2013-01-03   -1.340843
2013-01-04   -0.254842
2013-01-05   -0.772479
2013-01-06    0.608737
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.628005  0.586911 -0.092060 -0.668746
2013-01-02 -0.741923 -0.524688  0.127316  1.594454
2013-01-03 -1.340843  0.579010  0.312559 -0.646849

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.741923 -0.524688  0.127316  1.594454
2013-01-03 -1.340843  0.579010  0.312559 -0.646849
2013-01-04 -0.254842  0.828681 -0.886268  0.691116

### Selection by Label

label select [a, b], pos select [a, b)

In [26]:
df.loc[dates[0]]

A   -0.628005
B    0.586911
C   -0.092060
D   -0.668746
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.628005  0.586911
2013-01-02 -0.741923 -0.524688
2013-01-03 -1.340843  0.579010
2013-01-04 -0.254842  0.828681
2013-01-05 -0.772479  0.304728
2013-01-06  0.608737 -0.239192

In [29]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.741923 -0.524688
2013-01-03 -1.340843  0.579010
2013-01-04 -0.254842  0.828681

In [30]:
df.loc['20130102', ['A', 'B']]

A   -0.741923
B   -0.524688
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
df.loc[dates[0], 'A']

-0.6280051701172311

In [36]:
df.at[dates[0], 'A']

-0.6280051701172311

### Selection by Position

In [37]:
df.iloc[3]

A   -0.254842
B    0.828681
C   -0.886268
D    0.691116
Name: 2013-01-04 00:00:00, dtype: float64

In [38]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.254842  0.828681
2013-01-05 -0.772479  0.304728

In [39]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.741923  0.127316
2013-01-03 -1.340843  0.312559
2013-01-05 -0.772479  0.350528

In [48]:
df.iloc[1:3], df.iloc[1:3,], df.iloc[1:3,:]

(                   A         B         C         D
 2013-01-02 -0.741923 -0.524688  0.127316  1.594454
 2013-01-03 -1.340843  0.579010  0.312559 -0.646849,
                    A         B         C         D
 2013-01-02 -0.741923 -0.524688  0.127316  1.594454
 2013-01-03 -1.340843  0.579010  0.312559 -0.646849,
                    A         B         C         D
 2013-01-02 -0.741923 -0.524688  0.127316  1.594454
 2013-01-03 -1.340843  0.579010  0.312559 -0.646849)

In [49]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.586911 -0.092060
2013-01-02 -0.524688  0.127316
2013-01-03  0.579010  0.312559
2013-01-04  0.828681 -0.886268
2013-01-05  0.304728  0.350528
2013-01-06 -0.239192  0.370635

In [50]:
df.iloc[1,1]

-0.5246882282248232

In [51]:
df.iat[1,1]

-0.5246882282248232

### Boolean Indexing

In [52]:
df[df.A > 0]

                   A         B         C         D
2013-01-06  0.608737 -0.239192  0.370635 -1.092395

In [53]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.586911       NaN       NaN
2013-01-02       NaN       NaN  0.127316  1.594454
2013-01-03       NaN  0.579010  0.312559       NaN
2013-01-04       NaN  0.828681       NaN  0.691116
2013-01-05       NaN  0.304728  0.350528  1.052831
2013-01-06  0.608737       NaN  0.370635       NaN

In [54]:
df2 = df.copy()

In [55]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.628005  0.586911 -0.092060 -0.668746    one
2013-01-02 -0.741923 -0.524688  0.127316  1.594454    one
2013-01-03 -1.340843  0.579010  0.312559 -0.646849    two
2013-01-04 -0.254842  0.828681 -0.886268  0.691116  three
2013-01-05 -0.772479  0.304728  0.350528  1.052831   four
2013-01-06  0.608737 -0.239192  0.370635 -1.092395  three

In [56]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.340843  0.579010  0.312559 -0.646849   two
2013-01-05 -0.772479  0.304728  0.350528  1.052831  four

### Setting

In [68]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [69]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.628005  0.586911 -0.092060 -0.668746  NaN
2013-01-02 -0.741923 -0.524688  0.127316  1.594454  1.0
2013-01-03 -1.340843  0.579010  0.312559 -0.646849  2.0
2013-01-04 -0.254842  0.828681 -0.886268  0.691116  3.0
2013-01-05 -0.772479  0.304728  0.350528  1.052831  4.0
2013-01-06  0.608737 -0.239192  0.370635 -1.092395  5.0

In [71]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.586911 -0.092060 -0.668746  NaN
2013-01-02 -0.741923 -0.524688  0.127316  1.594454  1.0
2013-01-03 -1.340843  0.579010  0.312559 -0.646849  2.0
2013-01-04 -0.254842  0.828681 -0.886268  0.691116  3.0
2013-01-05 -0.772479  0.304728  0.350528  1.052831  4.0
2013-01-06  0.608737 -0.239192  0.370635 -1.092395  5.0

In [72]:
df.iat[0,1]=1
df

                   A         B         C         D    F
2013-01-01  0.000000  1.000000 -0.092060 -0.668746  NaN
2013-01-02 -0.741923 -0.524688  0.127316  1.594454  1.0
2013-01-03 -1.340843  0.579010  0.312559 -0.646849  2.0
2013-01-04 -0.254842  0.828681 -0.886268  0.691116  3.0
2013-01-05 -0.772479  0.304728  0.350528  1.052831  4.0
2013-01-06  0.608737 -0.239192  0.370635 -1.092395  5.0

In [74]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  1.000000 -0.092060  5  NaN
2013-01-02 -0.741923 -0.524688  0.127316  5  1.0
2013-01-03 -1.340843  0.579010  0.312559  5  2.0
2013-01-04 -0.254842  0.828681 -0.886268  5  3.0
2013-01-05 -0.772479  0.304728  0.350528  5  4.0
2013-01-06  0.608737 -0.239192  0.370635  5  5.0

In [75]:
df2 = df.copy()

In [76]:
df2[df2 > 0] = -df2

In [77]:
df2

                   A         B         C  D    F
2013-01-01  0.000000 -1.000000 -0.092060 -5  NaN
2013-01-02 -0.741923 -0.524688 -0.127316 -5 -1.0
2013-01-03 -1.340843 -0.579010 -0.312559 -5 -2.0
2013-01-04 -0.254842 -0.828681 -0.886268 -5 -3.0
2013-01-05 -0.772479 -0.304728 -0.350528 -5 -4.0
2013-01-06 -0.608737 -0.239192 -0.370635 -5 -5.0

## Missing Data

In [88]:
df

                   A         B         C  D    F
2013-01-01  0.000000  1.000000 -0.092060  5  NaN
2013-01-02 -0.741923 -0.524688  0.127316  5  1.0
2013-01-03 -1.340843  0.579010  0.312559  5  2.0
2013-01-04 -0.254842  0.828681 -0.886268  5  3.0
2013-01-05 -0.772479  0.304728  0.350528  5  4.0
2013-01-06  0.608737 -0.239192  0.370635  5  5.0

In [89]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1

In [90]:
df1, len(df1)

(                   A         B         C  D    F    E
 2013-01-01  0.000000  1.000000 -0.092060  5  NaN  1.0
 2013-01-02 -0.741923 -0.524688  0.127316  5  1.0  1.0
 2013-01-03 -1.340843  0.579010  0.312559  5  2.0  NaN
 2013-01-04 -0.254842  0.828681 -0.886268  5  3.0  NaN, 4)

In [91]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.741923 -0.524688  0.127316  5  1.0  1.0

In [92]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  1.000000 -0.092060  5  5.0  1.0
2013-01-02 -0.741923 -0.524688  0.127316  5  1.0  1.0
2013-01-03 -1.340843  0.579010  0.312559  5  2.0  5.0
2013-01-04 -0.254842  0.828681 -0.886268  5  3.0  5.0

In [95]:
df1.isna(), pd.isna(df1)

(                A      B      C      D      F      E
 2013-01-01  False  False  False  False   True  False
 2013-01-02  False  False  False  False  False  False
 2013-01-03  False  False  False  False  False   True
 2013-01-04  False  False  False  False  False   True,
                 A      B      C      D      F      E
 2013-01-01  False  False  False  False   True  False
 2013-01-02  False  False  False  False  False  False
 2013-01-03  False  False  False  False  False   True
 2013-01-04  False  False  False  False  False   True)

## Operations

### Stats

In [96]:
df.mean()

A   -0.416892
B    0.324757
C    0.030452
D    5.000000
F    3.000000
dtype: float64

In [97]:
df.mean(1)

2013-01-01    1.476985
2013-01-02    0.972141
2013-01-03    1.310145
2013-01-04    1.537514
2013-01-05    1.776555
2013-01-06    2.148036
Freq: D, dtype: float64

In [100]:
s = pd.Series([1,3,5, np.nan, 6,8], index = dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [103]:
df

                   A         B         C  D    F
2013-01-01  0.000000  1.000000 -0.092060  5  NaN
2013-01-02 -0.741923 -0.524688  0.127316  5  1.0
2013-01-03 -1.340843  0.579010  0.312559  5  2.0
2013-01-04 -0.254842  0.828681 -0.886268  5  3.0
2013-01-05 -0.772479  0.304728  0.350528  5  4.0
2013-01-06  0.608737 -0.239192  0.370635  5  5.0

In [104]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.340843 -0.420990 -0.687441  4.0  1.0
2013-01-04 -3.254842 -2.171319 -3.886268  2.0  0.0
2013-01-05 -5.772479 -4.695272 -4.649472  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

In [105]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  1.000000 -0.092060   5   NaN
2013-01-02 -0.741923  0.475312  0.035255  10   1.0
2013-01-03 -2.082766  1.054322  0.347814  15   3.0
2013-01-04 -2.337608  1.883003 -0.538454  20   6.0
2013-01-05 -3.110087  2.187731 -0.187926  25  10.0
2013-01-06 -2.501349  1.948539  0.182709  30  15.0

In [106]:
df.apply(lambda x:x.max() - x.min())

A    1.949580
B    1.524688
C    1.256903
D    0.000000
F    4.000000
dtype: float64

### Histogramming

In [107]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    0
2    6
3    5
4    1
5    6
6    3
7    3
8    3
9    0
dtype: int64

In [108]:
s.value_counts()

3    3
6    2
0    2
5    1
4    1
1    1
dtype: int64

### String Methods

In [109]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [110]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

### Concat

In [111]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.383561 -0.317452  2.236744  1.129389
1  0.240931  1.761161 -0.988792 -0.662078
2 -0.191981 -0.392106 -1.564145 -0.643176
3  0.950501  1.331966  2.307232  1.157795
4 -1.219800  1.252347  0.156561 -1.012290
5  1.134191  0.217812 -0.335579 -0.715642
6 -0.169204  0.417441 -2.083754  0.068256
7 -0.866094 -0.573301 -0.156245 -1.229075
8 -0.662406  0.283755  1.134144  0.773867
9 -1.446417 -0.093920 -2.754962  0.010461

In [113]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.383561 -0.317452  2.236744  1.129389
 1  0.240931  1.761161 -0.988792 -0.662078
 2 -0.191981 -0.392106 -1.564145 -0.643176,
           0         1         2         3
 3  0.950501  1.331966  2.307232  1.157795
 4 -1.219800  1.252347  0.156561 -1.012290
 5  1.134191  0.217812 -0.335579 -0.715642
 6 -0.169204  0.417441 -2.083754  0.068256,
           0         1         2         3
 7 -0.866094 -0.573301 -0.156245 -1.229075
 8 -0.662406  0.283755  1.134144  0.773867
 9 -1.446417 -0.093920 -2.754962  0.010461]

In [114]:
pd.concat(pieces)

          0         1         2         3
0  1.383561 -0.317452  2.236744  1.129389
1  0.240931  1.761161 -0.988792 -0.662078
2 -0.191981 -0.392106 -1.564145 -0.643176
3  0.950501  1.331966  2.307232  1.157795
4 -1.219800  1.252347  0.156561 -1.012290
5  1.134191  0.217812 -0.335579 -0.715642
6 -0.169204  0.417441 -2.083754  0.068256
7 -0.866094 -0.573301 -0.156245 -1.229075
8 -0.662406  0.283755  1.134144  0.773867
9 -1.446417 -0.093920 -2.754962  0.010461

### Join

In [115]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1,2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4,5]})

In [116]:
left, right

(   key  lval
 0  foo     1
 1  foo     2,    key  rval
 0  foo     4
 1  foo     5)

In [117]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [118]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1,2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4,5]})

In [119]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append

In [120]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.694389  0.972091 -1.282670  0.165280
1  0.894398 -0.154311 -0.189237  0.423357
2 -0.333668 -1.892158  1.599295 -2.050409
3  0.837260 -0.301963  0.116565  0.361621
4  1.868092 -0.546835 -0.686192 -0.135603
5 -1.795632  1.486123  1.256310 -0.749738
6  0.366690 -0.335535  1.100316 -1.469281
7  0.101790 -0.228792  2.317629 -0.938967

In [121]:
s = df.iloc[3]
s

A    0.837260
B   -0.301963
C    0.116565
D    0.361621
Name: 3, dtype: float64

In [122]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.694389  0.972091 -1.282670  0.165280
1  0.894398 -0.154311 -0.189237  0.423357
2 -0.333668 -1.892158  1.599295 -2.050409
3  0.837260 -0.301963  0.116565  0.361621
4  1.868092 -0.546835 -0.686192 -0.135603
5 -1.795632  1.486123  1.256310 -0.749738
6  0.366690 -0.335535  1.100316 -1.469281
7  0.101790 -0.228792  2.317629 -0.938967
8  0.837260 -0.301963  0.116565  0.361621

In [123]:
df.append(s)

          A         B         C         D
0 -0.694389  0.972091 -1.282670  0.165280
1  0.894398 -0.154311 -0.189237  0.423357
2 -0.333668 -1.892158  1.599295 -2.050409
3  0.837260 -0.301963  0.116565  0.361621
4  1.868092 -0.546835 -0.686192 -0.135603
5 -1.795632  1.486123  1.256310 -0.749738
6  0.366690 -0.335535  1.100316 -1.469281
7  0.101790 -0.228792  2.317629 -0.938967
3  0.837260 -0.301963  0.116565  0.361621

## Grouping

In [124]:
df = pd.DataFrame({
    'A': ['foo', 'bar', 'foo', 'bar',
          'foo', 'bar', 'foo', 'foo'],
    'B': ['one', 'one', 'two', 'three',
          'two', 'two', 'one', 'three'],
    'C': np.random.rand(8),
    'D': np.random.randn(8)
})
df

     A      B         C         D
0  foo    one  0.265591 -0.386192
1  bar    one  0.984365  0.244686
2  foo    two  0.808575 -0.088710
3  bar  three  0.312411 -0.449875
4  foo    two  0.063447  0.132624
5  bar    two  0.854054 -0.285970
6  foo    one  0.632119  0.230607
7  foo  three  0.784422  0.959201

In [125]:
df.groupby('A').sum()

            C         D
A
bar  2.150830 -0.491159
foo  2.554153  0.847529

In [126]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.984365  0.244686
    three  0.312411 -0.449875
    two    0.854054 -0.285970
foo one    0.897710 -0.155586
    three  0.784422  0.959201
    two    0.872021  0.043914

## Reshaping

### Stack

In [127]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two',]
                   ]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [131]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           codes=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [133]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -1.583854 -0.461750
      two    -0.374003 -0.034181
baz   one    -0.197981 -1.534591
      two    -0.284727  0.700599
foo   one     0.897598 -0.304667
      two     0.275452 -0.532303
qux   one    -0.540266 -2.070042
      two     0.841561 -0.320892